Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# settings.terminal.agentHibernation.subtitleOff
source: Scheduled hibernation is off. During critical memory pressure, cmux may still hibernate safe idle background agents.
ar: السبات المجدول متوقف. أثناء ضغط الذاكرة الحرج، قد يستمر cmux في إدخال وكلاء الخلفية الخاملين والآمنين في السبات.
de: Der geplante Ruhezustand ist deaktiviert. Bei kritischem Speicherengpass kann cmux dennoch im Hintergrund befindliche, inaktive Agenten sicher in den Ruhezustand versetzen.
es: La hibernación programada está desactivada. Durante una presión de memoria crítica, cmux aún puede hibernar agentes en segundo plano inactivos seguros.
fr: L’hibernation planifiée est désactivée. En cas de pression mémoire critique, cmux peut tout de même hiberner les agents en arrière-plan inactifs sûrs.
ja: 通常の休止はオフです。メモリ負荷が危険な状態では、安全なアイドル中のバックグラウンドエージェントを cmux が休止する場合があります。
ko: 예약된 최대 절전 기능이 꺼져 있습니다. 다만 메모리가 극도로 부족할 때 cmux는 백그라운드에 있는 안전한 유휴 에이전트를 최대 절전 모드로 전환할 수 있습니다.
zh_hans: 定时休眠已关闭。在内存压力临界时，cmux 仍可能休眠安全的空闲后台代理。
zh_hant: 排程休眠已關閉。當面臨緊急記憶體壓力時，cmux 仍可能會休眠安全且閒置的背景代理。

# settings.terminal.agentHibernation.subtitleOn
source: Idle background agent terminals can be hibernated when the live-terminal limit is exceeded.
ar: يمكن إدخال طرفيات الوكيل الخلفية الخاملة في السبات عند تجاوز الحد الأقصى للطرفيات النشطة.
de: Im Hintergrund befindliche, inaktive Agenten-Terminals können in den Ruhezustand versetzt werden, wenn das Limit für aktive Terminals überschritten wird.
es: Las terminales de agentes inactivas en segundo plano se pueden hibernar cuando se supera el límite de terminales activas.
fr: Les terminaux d’agent en arrière-plan inactifs peuvent être hibernés lorsque la limite de terminaux actifs est dépassée.
ja: ライブ端末数の上限を超えると、アイドル状態のバックグラウンドエージェント端末を休止できます。
ko: 활성 터미널 한도를 초과하면 백그라운드의 유휴 에이전트 터미널을 최대 절전 모드로 전환할 수 있습니다.
zh_hans: 超出活动终端数量上限时，空闲的后台代理终端可以被休眠。
zh_hant: 當超出作用中終端機限制時，閒置的背景代理終端機可以進入休眠。

# settings.terminal.copyOnSelect
source: Copy on Selection
ar: النسخ عند التحديد
bs: Kopiraj pri odabiru
da: Kopiér ved markering
de: Beim Auswählen kopieren
es: Copiar al seleccionar
fr: Copier à la sélection
it: Copia alla selezione
ja: 選択時にコピー
ko: 선택 시 복사
nb: Kopier ved markering
pl: Kopiuj po zaznaczeniu
pt_br: Copiar ao selecionar
ru: Копировать при выделении
th: คัดลอกเมื่อเลือก
tr: Seçimde kopyala
uk: Копіювати під час виділення
zh_hans: 选择时复制
zh_hant: 選取時複製

# settings.terminal.copyOnSelect.subtitleOff
source: cmux does not add system-clipboard copy on selection. Ghostty config still controls Paste Selection.
ar: لا يضيف cmux نسخًا إلى حافظة النظام عند التحديد. لا تزال إعدادات Ghostty تتحكم في «لصق التحديد».
bs: cmux ne dodaje kopiranje u sistemski međuspremnik pri odabiru. Ghostty konfiguracija i dalje kontroliše Lijepljenje odabira.
da: cmux tilføjer ikke kopiering til systemets udklipsholder ved markering. Ghostty-konfiguration styrer stadig Indsæt markering.
de: cmux fügt beim Auswählen kein Kopieren in die Systemzwischenablage hinzu. Die Ghostty-Konfiguration steuert weiterhin „Auswahl einfügen“.
es: cmux no añade copia al portapapeles del sistema al seleccionar. La configuración de Ghostty sigue controlando Pegar selección.
fr: cmux n’ajoute pas de copie vers le presse-papiers système lors de la sélection. La configuration Ghostty contrôle toujours Coller la sélection.
it: cmux non aggiunge la copia negli appunti di sistema alla selezione. La configurazione di Ghostty controlla ancora Incolla selezione.
ja: cmux は選択時のシステムクリップボードへのコピーを追加しません。Ghostty 設定が引き続き「選択をペースト」を制御します。
ko: cmux는 선택 시 시스템 클립보드 복사를 추가하지 않습니다. Ghostty 설정이 계속 Paste Selection을 제어합니다.
nb: cmux legger ikke til kopiering til systemutklippstavlen ved markering. Ghostty-konfigurasjonen styrer fortsatt Lim inn markering.
pl: cmux nie dodaje kopiowania do schowka systemowego przy zaznaczaniu. Konfiguracja Ghostty nadal steruje funkcją Wklej zaznaczenie.
pt_br: O cmux não adiciona cópia para a área de transferência do sistema ao selecionar. A configuração do Ghostty ainda controla Colar seleção.
ru: cmux не добавляет копирование в системный буфер обмена при выделении. Конфигурация Ghostty по-прежнему управляет «Вставить выделение».
th: cmux จะไม่เพิ่มการคัดลอกไปยังคลิปบอร์ดของระบบเมื่อเลือก การกำหนดค่า Ghostty ยังคงควบคุม Paste Selection
tr: cmux seçim sırasında sistem panosuna kopyalamayı eklemez. Ghostty yapılandırması Paste Selection denetimini sürdürür.
uk: cmux не додає копіювання до системного буфера обміну під час виділення. Конфігурація Ghostty й надалі керує «Вставити виділення».
zh_hans: cmux 不会在选择时额外复制到系统剪贴板。Ghostty 配置仍控制“粘贴选择”。
zh_hant: cmux 不會在選取時額外複製到系統剪貼簿。Ghostty 設定仍控制「貼上選取」。

# settings.terminal.copyOnSelect.subtitleOn
source: Selected terminal text is also copied to the system clipboard when the selection is committed.
ar: يُنسخ نص الطرفية المحدد أيضًا إلى حافظة النظام عند تثبيت التحديد.
bs: Odabrani tekst terminala također se kopira u sistemski međuspremnik kada se odabir potvrdi.
da: Markeret terminaltekst kopieres også til systemets udklipsholder, når markeringen bekræftes.
de: Ausgewählter Terminaltext wird zusätzlich in die Systemzwischenablage kopiert, sobald die Auswahl bestätigt wird.
es: El texto seleccionado del terminal también se copia al portapapeles del sistema cuando se confirma la selección.
fr: Le texte sélectionné dans le terminal est aussi copié dans le presse-papiers système lorsque la sélection est validée.
it: Il testo selezionato nel terminale viene copiato anche negli appunti di sistema quando la selezione viene confermata.
ja: 選択が確定したとき、ターミナルで選択したテキストをシステムクリップボードにもコピーします。
ko: 선택이 확정되면 선택한 터미널 텍스트도 시스템 클립보드에 복사됩니다.
nb: Markert terminaltekst kopieres også til systemutklippstavlen når markeringen bekreftes.
pl: Zaznaczony tekst terminala jest też kopiowany do schowka systemowego po zatwierdzeniu zaznaczenia.
pt_br: O texto selecionado no terminal também é copiado para a área de transferência do sistema quando a seleção é confirmada.
ru: Выделенный текст терминала также копируется в системный буфер обмена после подтверждения выделения.
th: ข้อความเทอร์มินัลที่เลือกจะถูกคัดลอกไปยังคลิปบอร์ดของระบบด้วยเมื่อยืนยันการเลือก
tr: Seçim kesinleştiğinde seçilen terminal metni sistem panosuna da kopyalanır.
uk: Вибраний текст термінала також копіюється до системного буфера обміну після підтвердження виділення.
zh_hans: 确认选择后，所选终端文本也会复制到系统剪贴板。
zh_hant: 確認選取後，所選終端機文字也會複製到系統剪貼簿。

# settings.terminal.memoryGuardrail
source: Runaway Memory Guardrail
ar: حاجز حماية الذاكرة الجامحة
de: Schutz vor ausufernder Speichernutzung
es: Protección contra memoria descontrolada
fr: Garde-fou pour mémoire hors de contrôle
ja: 暴走メモリガードレール
ko: 메모리 폭주 가드레일
zh_hans: 内存失控防护
zh_hant: 記憶體失控防護機制

# settings.terminal.memoryGuardrail.subtitleOff
source: No warning is shown when a pane's process tree grows large. A leaking process can OOM-suspend the entire app.
ar: لا يظهر أي تحذير عندما تصبح شجرة عمليات الجزء كبيرة. يمكن أن تؤدي عملية تسريب إلى تعليق التطبيق بأكمله بسبب نفاد الذاكرة (OOM).
de: Es wird keine Warnung angezeigt, wenn der Prozessbaum eines Teilfensters stark anwächst. Ein Speicherleck in einem Prozess kann die gesamte App durch einen Out-of-Memory-Fehler lahmlegen.
es: No se muestra ninguna advertencia cuando el árbol de procesos de un panel crece demasiado. Un proceso con fugas de memoria puede suspender toda la aplicación por falta de memoria (OOM).
fr: Aucun avertissement ne s’affiche lorsque l’arborescence des processus d’un volet s'agrandit. Un processus qui fuit peut suspendre l’application entière par manque de mémoire (OOM).
ja: ペインのプロセスツリーが大きくなっても警告は表示されません。リークしたプロセスがアプリ全体を OOM で停止させる可能性があります。
ko: 분할 창의 프로세스 트리가 거대해져도 경고가 표시되지 않습니다. 프로세스 누수로 인해 앱 전체가 OOM(메모리 부족)으로 정지될 수 있습니다.
zh_hans: 窗格的进程树变大时不显示警告。泄漏的进程可能因内存不足导致整个应用被挂起。
zh_hant: 當窗格的處理程序樹增長過大時，不會顯示任何警告。發生洩漏的處理程序可能會導致整個軟體因記憶體耗盡（OOM）而暫停。

# settings.terminal.memoryGuardrail.subtitleOn
source: cmux warns you with a badge and a banner when one pane's process tree uses too much memory, so a single leak can't crash the whole app.
ar: يحذرك cmux بشارة ولافتة عندما تستهلك شجرة عمليات جزء واحد ذاكرة أكثر من اللازم، حتى لا يتسبب تسريب واحد في تعطل التطبيق بأكمله.
de: cmux warnt Sie mit einem Badge und einem Banner, wenn der Prozessbaum eines Teilfensters zu viel Speicher verbraucht, sodass ein einzelnes Leck nicht die gesamte App abstürzen lassen kann.
es: cmux te advierte con una insignia y un banner cuando el árbol de procesos de un panel usa demasiada memoria, de modo que una sola fuga no pueda colapsar toda la aplicación.
fr: cmux vous avertit par un badge et une bannière lorsque l’arborescence des processus d’un volet utilise trop de mémoire, afin qu’une simple fuite ne fasse pas planter toute l’application.
ja: 1つのペインのプロセスツリーが過剰なメモリを使用すると、バッジとバナーで警告します。1件のリークでアプリ全体がクラッシュするのを防ぎます。
ko: 하나의 분할 창에 속한 프로세스 트리가 메모리를 지나치게 많이 사용하면 cmux가 배지와 배너로 경고를 표시하므로, 단일 누수로 인해 앱 전체가 다운되는 것을 방지합니다.
zh_hans: 当某个窗格的进程树占用过多内存时，cmux 会用角标和横幅提示，避免单个泄漏拖垮整个应用。
zh_hant: 當單一窗格的處理程序樹耗用過多記憶體時，cmux 會以徽章和橫幅警告您，如此一來，單一洩漏就不會導致整個軟體當機。

# settings.terminal.memoryGuardrail.threshold
source: Memory Warning Threshold (GB)
ar: عتبة تحذير الذاكرة (جيجابايت)
de: Grenzwert für Speicherwarnung (GB)
es: Umbral de advertencia de memoria (GB)
fr: Seuil d'avertissement de mémoire (Go)
ja: メモリ警告のしきい値（GB）
ko: 메모리 경고 임계값 (GB)
zh_hans: 内存警告阈值（GB）
zh_hant: 記憶體警告門檻值 (GB)

# settings.terminal.memoryGuardrail.threshold.subtitle
source: A pane is flagged once its combined process-tree memory crosses this many gigabytes.
ar: يتم تمييز الجزء بمجرد أن تتجاوز الذاكرة المجمعة لشجرة عملياته هذا العدد من الجيجابايت.
de: Ein Teilfenster wird markiert, sobald der Speicher des gesamten Prozessbaums diese Anzahl an Gigabytes überschreitet.
es: Un panel se marca una vez que la memoria combinada de su árbol de procesos supera esta cantidad de gigabytes.
fr: Un volet est signalé dès que la mémoire combinée de son arborescence de processus dépasse ce nombre de gigaoctets.
ja: ペインのプロセスツリーの合計メモリがこのギガバイト数を超えるとフラグが立てられます。
ko: 분할 창의 결합된 프로세스 트리 메모리가 지정된 기가바이트를 초과하면 해당 분할 창에 플래그가 지정됩니다.
zh_hans: 当窗格的进程树内存合计超过这么多 GB 时，该窗格会被标记。
zh_hant: 一旦窗格的處理程序樹合併記憶體超過此 GB 數，該窗格就會被標記。

# settings.terminal.rendererRealization
source: Reclaim Offscreen Terminal Memory
ar: استعادة ذاكرة الطرفية الخارجة عن الشاشة
de: Speicher von nicht sichtbaren Terminals freigeben
es: Reclama la memoria de las terminales fuera de pantalla
fr: Récupérer la mémoire du terminal hors écran
ja: オフスクリーン端末のメモリを回収
ko: 화면 밖 터미널 메모리 회수
zh_hans: 回收屏幕外终端内存
zh_hant: 回收螢幕外終端機記憶體

# settings.terminal.rendererRealization.idleSeconds
source: Reclaim After Idle Seconds
ar: الاستعادة بعد ثوانٍ من الخمول
de: Freigeben nach Sekunden im Leerlauf
es: Reclamar después de segundos de inactividad
fr: Récupérer après plusieurs secondes d'inactivité
ja: アイドル秒数経過後に回収
ko: 유휴 시간(초) 후 회수
zh_hans: 空闲多少秒后回收
zh_hant: 閒置指定秒數後回收

# settings.terminal.rendererRealization.idleSeconds.subtitle
source: An off-screen terminal must stay off-screen this long before its renderer memory is reclaimed.
ar: يجب أن تظل الطرفية الخارجة عن الشاشة خارج الشاشة لهذه المدة قبل استعادة ذاكرة مصيرها.
de: Ein nicht sichtbares Terminal muss so lange außerhalb des Bildschirms bleiben, bevor der Speicher seines Renderers freigegeben wird.
es: Una terminal fuera de pantalla debe permanecer fuera de pantalla este tiempo antes de que se reclame la memoria de su renderizador.
fr: Un terminal hors écran doit le rester pendant cette durée avant que la mémoire de son moteur de rendu ne soit récupérée.
ja: オフスクリーンの端末は、レンダラーのメモリが回収されるまでこの時間オフスクリーンのままである必要があります。
ko: 화면 밖의 터미널이 이 시간 동안 화면 밖에 유지되어야 렌더러 메모리가 회수됩니다.
zh_hans: 屏幕外终端必须保持在屏幕外这么久，其渲染器内存才会被回收。
zh_hant: 螢幕外終端機必須保持在螢幕外達此長度，其轉譯器記憶體才會被回收。

# settings.terminal.rendererRealization.maxWarmRenderers
source: Max Warm Renderers
ar: الحد الأقصى للمصيرات الجاهزة
de: Maximale Anzahl warmer Renderer
es: Renderizadores listos máximos
fr: Nombre max de moteurs de rendu prêts
ja: ウォームレンダラーの最大数
ko: 최대 웜 렌더러 수
zh_hans: 最大热渲染器数
zh_hant: 保持預熱的轉譯器數量上限

# settings.terminal.rendererRealization.maxWarmRenderers.subtitle
source: The most recently visible terminals keep their renderer ready so switching stays instant. Extra off-screen renderers are reclaimed oldest first.
ar: تحتفظ الطرفيات الأحدث ظهورًا بمصيرها جاهزًا بحيث يظل التبديل فوريًا. يتم استعادة المصيرات الخارجة عن الشاشة الإضافية، الأقدم أولاً.
de: Die zuletzt sichtbaren Terminals halten ihren Renderer bereit, damit das Umschalten sofort erfolgt. Zusätzliche nicht sichtbare Renderer werden beginnend mit dem ältesten freigegeben.
es: Las terminales visibles más recientemente mantienen su renderizador listo para que el cambio siga siendo instantáneo. Los renderizadores fuera de pantalla adicionales se reclaman empezando por el más antiguo.
fr: Les terminaux les plus récemment visibles maintiennent leur moteur de rendu prêt pour un changement instantané. Les moteurs de rendu hors écran supplémentaires sont récupérés en commençant par les plus anciens.
ja: 最近表示した端末はレンダラーを準備状態に保ち、切り替えを高速に保ちます。余分なオフスクリーンのレンダラーは古いものから回収されます。
ko: 가장 최근에 표시된 터미널은 렌더러를 준비 상태로 유지하여 전환이 즉시 이루어지도록 합니다. 추가로 존재하는 화면 밖의 렌더러는 가장 오래된 것부터 차례대로 회수됩니다.
zh_hans: 最近可见的终端会保留其渲染器就绪状态，以便切换保持瞬时。多出的屏幕外渲染器按最旧优先回收。
zh_hant: 最近顯示的終端機會保持其轉譯器就緒，以便即時進行切換。超出上限的螢幕外轉譯器將從最舊的開始回收。

# settings.terminal.rendererRealization.subtitleOff
source: Every visited terminal keeps its full GPU renderer allocated until you close it, even when off-screen.
ar: تحتفظ كل طرفية تمت زيارتها بمصير GPU الكامل المخصص لها حتى تقوم بإغلاقها، حتى عندما تكون خارج الشاشة.
de: Jedes geöffnete Terminal behält seinen zugewiesenen GPU-Renderer, bis Sie es schließen, selbst wenn es nicht sichtbar ist.
es: Cada terminal visitada mantiene su renderizador de GPU completo asignado hasta que la cierres, incluso cuando está fuera de pantalla.
fr: Chaque terminal visité conserve la totalité de son moteur de rendu GPU alloué jusqu’à sa fermeture, même lorsqu’il est hors écran.
ja: 訪問した端末は、オフスクリーンでも閉じるまでGPUレンダラーをすべて確保し続けます。
ko: 한 번 방문한 모든 터미널은 닫기 전까지는 화면 밖에 있더라도 전체 GPU 렌더러를 할당된 상태로 유지합니다.
zh_hans: 每个访问过的终端在关闭前都会一直占用完整的 GPU 渲染器，即使在屏幕外也是如此。
zh_hant: 即使位於螢幕外，每個存取過的終端機都會維持配置完整的 GPU 轉譯器，直到您將其關閉為止。

# settings.terminal.rendererRealization.subtitleOn
source: Off-screen terminals release their GPU renderer memory while idle and rebuild it instantly when you switch back. The process keeps running.
ar: تحرر الطرفيات الخارجة عن الشاشة ذاكرة مصير GPU الخاص بها أثناء الخمول وتقوم بإعادة بنائها فورًا عند الرجوع إليها. وتستمر العملية في العمل.
de: Nicht sichtbare Terminals geben ihren GPU-Renderer-Speicher im Leerlauf frei und bauen ihn beim Zurückwechseln sofort wieder auf. Der Prozess läuft im Hintergrund weiter.
es: Las terminales fuera de pantalla liberan su memoria de renderizador de GPU mientras están inactivas y la reconstruyen instantáneamente cuando vuelves a cambiar a ellas. El proceso sigue ejecutándose.
fr: Les terminaux hors écran libèrent la mémoire de leur moteur de rendu GPU lorsqu’ils sont inactifs et la reconstruisent instantanément lorsque vous y revenez. Le processus continue de s’exécuter.
ja: オフスクリーンの端末はアイドル中にGPUレンダラーのメモリを解放し、切り替え時に即座に再構築します。プロセスは動作し続けます。
ko: 화면 밖에 있는 터미널은 유휴 상태일 때 GPU 렌더러 메모리를 해제하고, 사용자가 다시 전환할 때 즉시 재구축합니다. 해당 프로세스는 계속 실행됩니다.
zh_hans: 屏幕外终端在空闲时释放其 GPU 渲染器内存，切换回来时会瞬时重建。进程会继续运行。
zh_hant: 螢幕外的終端機在閒置時會釋放其 GPU 轉譯器記憶體，並在您切換回時立即重建。程序將保持執行。

# settings.terminal.resumeCommands
source: Resume Commands
ar: أوامر الاستئناف
de: Fortsetzungsbefehle
es: Comandos de reanudación
fr: Commandes de reprise
ja: 復元コマンド
ko: 재개 명령
zh_hans: 恢复命令
zh_hant: 恢復指令

# settings.terminal.resumeCommands.cwdSummary
source: Prefix: %@, cwd: %@
ar: البادئة: %@، cwd: %@
de: Präfix: %@, cwd: %@
es: Prefijo: %@, cwd: %@
fr: Préfixe : %@, cwd : %@
ja: プレフィックス: %@、cwd: %@
ko: 접두사: %@, cwd: %@
zh_hans: 前缀：%@，cwd：%@
zh_hant: 前綴：%@，工作目錄：%@

# settings.terminal.resumeCommands.delete
source: Delete
ar: حذف
de: Löschen
es: Borrar
fr: Supprimer
ja: 削除
ko: 삭제
zh_hans: 删除
zh_hant: 刪除

# settings.terminal.resumeCommands.deleteFailed
source: Could not delete the resume command approval.
ar: تعذر حذف الموافقة على أمر الاستئناف.
de: Die Freigabe des Fortsetzungsbefehls konnte nicht gelöscht werden.
es: No se pudo eliminar la aprobación del comando de reanudación.
fr: Impossible de supprimer l’approbation de la commande de reprise.
ja: 復元コマンドの承認を削除できませんでした。
ko: 재개 명령 승인을 삭제할 수 없습니다.
zh_hans: 无法删除该恢复命令授权。
zh_hant: 無法刪除恢復指令核准。

# settings.terminal.resumeCommands.deleted
source: Resume command approval deleted.
ar: تم حذف الموافقة على أمر الاستئناف.
de: Freigabe des Fortsetzungsbefehls gelöscht.
es: Aprobación del comando de reanudación eliminada.
fr: Approbation de la commande de reprise supprimée.
ja: 復元コマンドの承認を削除しました。
ko: 재개 명령 승인이 삭제되었습니다.
zh_hans: 恢复命令授权已删除。
zh_hant: 恢復指令核准已刪除。

# settings.terminal.resumeCommands.empty
source: No custom resume commands have been approved.
ar: لم تتم الموافقة على أي أوامر استئناف مخصصة.
de: Es wurden keine benutzerdefinierten Fortsetzungsbefehle freigegeben.
es: No se ha aprobado ningún comando de reanudación personalizado.
fr: Aucune commande de reprise personnalisée n’a été approuvée.
ja: 承認済みのカスタム復元コマンドはありません。
ko: 승인된 사용자 정의 재개 명령이 없습니다.
zh_hans: 尚未授权任何自定义恢复命令。
zh_hant: 尚未核准任何自訂恢復指令。

# settings.terminal.resumeCommands.invalidPrefix
source: Enter a valid shell-style command prefix.
ar: أدخل بادئة أمر صالحة بنمط shell.
de: Geben Sie ein gültiges Befehlspräfix im Shell-Stil ein.
es: Introduce un prefijo de comando válido estilo shell.
fr: Saisissez un préfixe de commande de type shell valide.
ja: 有効なシェル形式のコマンドプレフィックスを入力してください。
ko: 유효한 셸 형식의 명령 접두사를 입력하십시오.
zh_hans: 请输入有效的 shell 风格命令前缀。
zh_hant: 請輸入有效的 shell 風格指令前綴。

# settings.terminal.resumeCommands.invalidSignature
source: Signature does not match. Delete this approval and approve the command again.
ar: التوقيع غير متطابق. احذف هذه الموافقة ووافق على الأمر مرة أخرى.
de: Signatur stimmt nicht überein. Löschen Sie diese Freigabe und geben Sie den Befehl erneut frei.
es: La firma no coincide. Elimina esta aprobación y vuelve a aprobar el comando.
fr: La signature ne correspond pas. Supprimez cette approbation et approuvez à nouveau la commande.
ja: 署名が一致しません。この承認を削除してから、コマンドを再度承認してください。
ko: 서명이 일치하지 않습니다. 이 승인을 삭제하고 명령을 다시 승인하십시오.
zh_hans: 签名不匹配。请删除此授权并重新授权该命令。
zh_hant: 簽章不符。請刪除此核准並重新核准該指令。

# settings.terminal.resumeCommands.policy.auto
source: Auto
ar: آلي
es: Automático
fr: Automatique
ja: 自動
ko: 자동
zh_hans: 自动
zh_hant: 汽車

# settings.terminal.resumeCommands.policy.manual
source: Manual
ar: يدوي
de: Manuell
fr: Manuel
ja: 手動
ko: 수동
zh_hans: 手动
zh_hant: 手動

# settings.terminal.resumeCommands.policy.prompt
source: Ask
ar: سؤال
de: Nachfragen
es: Preguntar
fr: Demander
ja: 確認
ko: 묻기
zh_hans: 询问
zh_hant: 詢問

# settings.terminal.resumeCommands.prefixPlaceholder
source: Command prefix
ar: بادئة الأمر
de: Befehlspräfix
es: Prefijo de comando
fr: Préfixe de commande
ja: コマンドプレフィックス
ko: 명령 접두사
zh_hans: 命令前缀
zh_hant: 指令前綴

# settings.terminal.resumeCommands.prefixSummary
source: Prefix: %@
ar: البادئة: %@
de: Präfix: %@
es: Prefijo: %@
fr: Préfixe : %@
ja: プレフィックス: %@
ko: 접두사: %@
zh_hans: 前缀：%@
zh_hant: 前綴：%@

# settings.terminal.resumeCommands.save
source: Save
ar: حفظ
de: Speichern
es: Guardar
fr: Enregistrer
ja: 保存
ko: 저장
zh_hans: 保存
zh_hant: 儲存

# settings.terminal.resumeCommands.sourceUnknown
source: Unknown source
ar: مصدر غير معروف
de: Unbekannte Quelle
es: Origen desconocido
fr: Source inconnue
ja: 不明なソース
ko: 알 수 없는 출처
zh_hans: 来源未知
zh_hant: 未知來源

# settings.terminal.resumeCommands.subtitle
source: Review signed command prefixes that can restore non-agent terminal surfaces.
ar: مراجعة بادئات الأوامر الموقعة التي يمكنها استعادة أسطح الطرفيات غير التابعة لوكلاء.
de: Überprüfen Sie signierte Befehlspräfixe, die Terminal-Oberflächen von Nicht-Agenten wiederherstellen können.
es: Revisa los prefijos de comandos firmados que pueden restaurar superficies de terminal que no sean de agentes.
fr: Passez en revue les préfixes de commande signés qui peuvent restaurer les surfaces d’affichage de terminal autres que celles des agents.
ja: 非エージェントのターミナルサーフェスを復元できる署名済みコマンドプレフィックスを確認します。
ko: 에이전트가 아닌 터미널 화면을 복원할 수 있는 서명된 명령 접두사를 검토합니다.
zh_hans: 查看可用于恢复非代理终端表面的已签名命令前缀。
zh_hant: 檢視可還原非代理終端機介面的已簽署指令前綴。

# settings.terminal.resumeCommands.updateFailed
source: Could not update the resume command approval.
ar: تعذر تحديث الموافقة على أمر الاستئناف.
de: Die Freigabe des Fortsetzungsbefehls konnte nicht aktualisiert werden.
es: No se pudo actualizar la aprobación del comando de reanudación.
fr: Impossible de mettre à jour l’approbation de la commande de reprise.
ja: 復元コマンドの承認を更新できませんでした。
ko: 재개 명령 승인을 업데이트할 수 없습니다.
zh_hans: 无法更新该恢复命令授权。
zh_hant: 無法更新恢復指令核准。

# settings.terminal.resumeCommands.updated
source: Resume command approval updated.
ar: تم تحديث الموافقة على أمر الاستئناف.
de: Freigabe des Fortsetzungsbefehls aktualisiert.
es: Aprobación del comando de reanudación actualizada.
fr: Approbation de la commande de reprise mise à jour.
ja: 復元コマンドの承認を更新しました。
ko: 재개 명령 승인이 업데이트되었습니다.
zh_hans: 恢复命令授权已更新。
zh_hant: 恢復指令核准已更新。

# settings.terminal.scrollBar
source: Show Terminal Scroll Bar
ar: عرض شريط تمرير الطرفية
de: Terminal-Bildlaufleiste anzeigen
es: Mostrar barra de desplazamiento de la terminal
fr: Afficher la barre de défilement du terminal
ja: ターミナルのスクロールバーを表示
ko: 터미널 스크롤 바 표시
zh_hans: 显示终端滚动条
zh_hant: 顯示終端機捲動軸

# settings.terminal.scrollBar.subtitleOff
source: Hides the right-edge terminal scroll bar everywhere. Changes apply immediately and persist across relaunches.
ar: يخفي شريط تمرير الطرفية في الحافة اليمنى في كل مكان. تطبق التغييرات على الفور وتستمر عبر عمليات إعادة التشغيل.
de: Blendet die Terminal-Bildlaufleiste am rechten Rand überall aus. Änderungen werden sofort wirksam und bleiben auch nach einem Neustart bestehen.
es: Oculta la barra de desplazamiento de la terminal del borde derecho en todas partes. Los cambios se aplican de inmediato y persisten entre reinicios.
fr: Masque la barre de défilement du terminal sur le bord droit partout. Les modifications s'appliquent immédiatement et persistent après redémarrage.
ja: 右端のターミナルスクロールバーを全体で非表示にします。変更はすぐに反映され、再起動後も保持されます。
ko: 모든 곳에서 오른쪽 터미널 스크롤 바를 숨깁니다. 변경 사항은 즉시 적용되며 다시 실행해도 유지됩니다.
zh_hans: 在所有位置隐藏终端右边缘的滚动条。更改立即生效并在重启后保持。
zh_hant: 在所有位置隱藏右側邊緣的終端機捲動軸。變更會立即套用並在重新啟動後持續生效。

# settings.terminal.scrollBar.subtitleOn
source: Shows the right-edge terminal scroll bar in shell scrollback. cmux hides it automatically for alternate-screen style TUI surfaces.
ar: يعرض شريط تمرير الطرفية في الحافة اليمنى في تراجع الـ shell. يخفيه cmux تلقائيًا لأسطح TUI بنمط الشاشة البديلة.
de: Zeigt die Terminal-Bildlaufleiste am rechten Rand beim Shell-Scrollback an. cmux blendet sie für TUI-Oberflächen mit alternativem Bildschirm automatisch aus.
es: Muestra la barra de desplazamiento de la terminal del borde derecho en el desplazamiento del historial de la shell. cmux la oculta automáticamente para superficies TUI de estilo pantalla alternativa.
fr: Affiche la barre de défilement du terminal sur le bord droit dans l’historique du shell. cmux la masque automatiquement pour les surfaces d’affichage TUI de style écran alternatif.
ja: シェルのスクロールバックでは右端のターミナルスクロールバーを表示します。cmux は代替画面系の TUI では自動的に隠します。
ko: 셸 스크롤백에서 오른쪽 터미널 스크롤 바를 표시합니다. 대체 화면 스타일의 TUI 화면에서는 cmux가 자동으로 숨깁니다.
zh_hans: 在 shell 回滚区中显示终端右边缘的滚动条。对备用屏风格的 TUI 表面，cmux 会自动隐藏它。
zh_hant: 在 shell 向上捲動時顯示右側邊緣的終端機捲動軸。對於備用畫面風格的 TUI 介面，cmux 會自動將其隱藏。

# settings.terminal.scrollSpeed
source: Scroll Speed
ar: سرعة التمرير
de: Scrollgeschwindigkeit
es: Velocidad de desplazamiento
fr: Vitesse de défilement
ja: スクロール速度
ko: 스크롤 속도
zh_hans: 滚动速度
zh_hant: 捲動速度

# settings.terminal.scrollSpeed.reset
source: Reset
ar: إعادة تعيين
de: Zurücksetzen
es: Restablecer
fr: Réinitialiser
ja: リセット
ko: 재설정
zh_hans: 重置
zh_hant: 重置
